"Restore Data" = "Restore Data";
"Backup Time" = "Backup Time";
"Select Backup file..." = "Select Backup file...";
"Restore" = "Restore";

"Error when restoring backup" = "Error when restoring backup";
"The selected backup file does not exist." = "The selected backup file does not exist.";
"Select a .atext file to restore" = "Select a .atext file to restore";